{
  "docs": {
    "title": "คู่มือการรวมระบบ",
    "subtitle": "เลือกวิธีที่คุณต้องการรวม CheckoutBay เข้ากับเว็บไซต์ของคุณ เริ่มขายได้ภายในไม่กี่นาทีด้วยตัวเลือกการรวมระบบที่ง่ายดาย",
    
    "previewShop": "ดูตัวอย่างร้านค้าของคุณ",
    "previewShopDescription": "ดูว่าร้านค้าของคุณจะแสดงให้ลูกค้าเห็นอย่างไรก่อนเปิดตัว ทดสอบประสบการณ์การช็อปปิ้งแบบครบวงจร รวมถึงการแสดงสินค้า ฟังก์ชันตะกร้า และขั้นตอนการชำระเงิน",
    "openPreviewShop": "เปิดตัวอย่าง",
    
    "jsLibrary": "JavaScript Library",
    "jsLibraryDescription": "เพิ่มฟังก์ชันอีคอมเมิร์ซให้กับเว็บไซต์ใดๆ ด้วยเพียงแท็ก script เดียว เหมาะสำหรับบล็อก หน้าแลนดิ้ง และเว็บไซต์ที่มีอยู่แล้ว",
    
    "customApiTitle": "การรวมระบบ API แบบกำหนดเอง",
    "customApiDescription": "สร้างประสบการณ์การช็อปปิ้งที่กำหนดเองอย่างสมบูรณ์โดยใช้ REST API ของเรา ควบคุมการออกแบบและการไหลของผู้ใช้อย่างเต็มที่สำหรับนักพัฒนาขั้นสูง",
    
    "getInstructions": "ดูคำแนะนำ",
    
    "needHelp": "ต้องการความช่วยเหลือ?",
    "helpDescription": "ดูคู่มือการรวมระบบโดยละเอียดและตัวอย่างโค้ดเพื่อเริ่มต้นอย่างรวดเร็ว",
    
    "quickTip": "เคล็ดลับด่วน",
    "jsLibraryQuickTip": "JavaScript library ต้องการเพียงแท็ก script เดียวและจัดการการจัดการตะกร้า การประมวลผลการชำระเงิน และการออกแบบที่ตอบสนองโดยอัตโนมัติ เหมาะสำหรับกรณีการใช้งานส่วนใหญ่",
    
    "apiOverview": "ภาพรวม API",
    "apiOverviewDescription": "REST API ของเราให้คุณควบคุมประสบการณ์การช็อปปิ้งอย่างสมบูรณ์ สร้างอินเทอร์เฟซแบบกำหนดเอง รวมกับระบบที่มีอยู่ หรือสร้างแอปพลิเคชันมือถือ",
    
    "quickStart": "เริ่มต้นอย่างรวดเร็ว",
    "quickStartDesc": "คัดลอกและวางโค้ดนี้เพื่อเริ่มต้นทันที",
    
    "customButtons": "ปุ่มแบบกำหนดเอง",
    "customButtonsDesc": "เปลี่ยนองค์ประกอบ HTML ใดๆ ให้เป็นปุ่ม 'เพิ่มลงตะกร้า'",
    
    "installationMethods": "วิธีการติดตั้ง",
    "cdnRecommended": "CDN (แนะนำ)",
    "selfHosted": "Self-Hosted",
    
    "globalConfiguration": "การกำหนดค่าทั่วไป",
    "javascriptApi": "JavaScript API",
    
    "stylingThemes": "การจัดแต่งและธีม",
    "cssCustomProperties": "CSS Custom Properties",
    "cssClasses": "CSS Classes",
    
    "apiFeatures": "คุณสมบัติ API",
    "feature1": "การติดตามสินค้าคงคลังแบบเรียลไทม์",
    "feature2": "รองรับหลายสกุลเงิน",
    "feature3": "การคำนวณภาษีอัตโนมัติ",
    "feature4": "อัตราการจัดส่งทั่วโลก",
    
    "commonMethods": "วิธีการ API ทั่วไป",
    
    "getShopDetails": "รับรายละเอียดร้านค้า",
    "getProducts": "รับสินค้า",
    "calculateOrder": "คำนวณคำสั่งซื้อ",
    "createOrder": "สร้างคำสั่งซื้อ",
    "createPayment": "สร้างการชำระเงิน",
    "getOrderStatus": "รับสถานะคำสั่งซื้อ"
  }
}